STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_hal_aes.c
  * @brief   AES HAL module driver.
  *          This file provides Cryptography AES/SAES peripheral services.
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ------------------------------------------------------------------ */
#include "stm32_hal.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

#if defined(AES) || defined(SAES)

/** @addtogroup AES
  * @{
  */
/** @defgroup AES_Introduction AES Introduction
  * @{

  - This introduction is under development.

  */
/**
  * @}
  */

/** @defgroup AES_How_To_Use AES How To Use
  * @{

# How to use the AES HAL module driver

## The AES main features:

This AES HAL driver is a generic driver which contains a set of APIs allowing to configure the AES/SAES
peripheral to an advanced encryption standard compliant algorithm in order to perform data encryption or decryption.

## The AES HAL driver can be used as follows:

### Initialization/De-initialization

- Declare a hal_aes_handle_t handle structure, for example: hal_aes_handle_t  haes

- Initialize the AES low level resources:
  - Enable the AES/SAES peripheral clock:
    - Either at the application level by calling the:
      - **HAL_RCC_AES_EnableClock()** API for AES instance
      - **HAL_RCC_SAES_EnableClock()** API for SAES instance
    - Or by setting the USE_HAL_AES_CLK_ENABLE_MODEL define to HAL_CLK_ENABLE_PERIPH_ONLY within the
      stm32u5xx_hal_conf.h file, in this case, the AES/SAES clock is enabled within
      the HAL_AES_Init() API
  - NVIC configuration to use interrupt process APIs (HAL_AES_Encrypt_IT() and HAL_AES_Decrypt_IT()):
    - Configure the AES interrupt priority
    - Enable the NVIC AES IRQ Channel
  - DMA Configuration to use DMA process APIs(HAL_AES_Encrypt_DMA() and HAL_AES_Decrypt_DMA()):
    - Declare a hal_dma_handle_t handle structure for the transfer input or transfer output channel
    - Enable the DMAx interface clock using
    - Configure the DMA handle parameters
    - Configure the DMA Inx or Outx channel
    - Associate the initialized DMA handle to the haes DMA In or Out handle
    - Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA In or Out channel

- Initialize the AES handle by calling the HAL_AES_Init() API that performs these operations:
  - The association of the instance to the handle
  - The initialization of the handle state to the HAL_AES_STATE_INIT

- De-initialize the AES/SAES peripheral by calling the HAL_AES_DeInit() API that performs these operations:
  - The disable of the AES/SAES peripheral
  - The abort of the DMA input and output transfers
  - The de-initialization of the current handle object
  - The reset of the handle state to the HAL_AES_STATE_RESET

### Configuration

- The Configuration of the AES/SAES peripheral is ensured through three steps:
  - Step1 (Chaining mode(algorithm) configuration according to the defined compilation algorithm flag):
    - By default, all the compilation algorithm flags are defined but the user can undefine the not needed ones to well
      optimize his code and gain footprint.
    - The AES compilation algorithm flags are:
       - USE_HAL_AES_ECB_CBC_ALGO flag: The AES/SAES peripheral can be configured with one of the
       two following chaining modes:
           - Electronic Code Book algorithm(ECB) by using HAL_AES_ECB_SetConfig() API, the user has not to set any
             parameter
           - Cipher Block Chaining algorithm(CBC) by using HAL_AES_CBC_SetConfig() API where the user must provide the
             initial vector
       - USE_HAL_AES_CTR_ALGO flag: The AES peripheral is configured to Counter chaining mode(CTR) by using
         HAL_AES_CTR_SetConfig() API where the user must provide the initial vector
       - USE_HAL_AES_GCM_GMAC_ALGO flag: The AES peripheral is configured to Galois/counter chaining mode(GCM/GMAC) by
         using HAL_AES_GCM_GMAC_SetConfig() API where the user must provide the header, its size and the initial vector
       - USE_HAL_AES_CCM_ALGO flag: The AES peripheral is configured to Counter with Cipher Block Chaining-Message(CCM)
         by using HAL_AES_CCM_SetConfig() API where the user must provide the header, its size and the B0
  - Step2 (Key configuration according to one of the following use cases):
    - Use the application normal key:
        - Call HAL_AES_SetNormalKey() API where the user must provide the key and its size
        - This API is available with AES/SAES peripheral
    - Use the SAES Hardware key:
        - Call HAL_AES_SetHWKey() API where the user must set the SAES hardware key and set its size and the key mode:
            - The normal key mode is set when to use the HW key to encrypt/decrypt application messages
            - The wrap key mode is set when to use the HW key to wrap/unwrap the application key
            - The share key mode is set when to use the HW key to share/unshare the application key
        - This API is only available with SAES peripheral
        - When the selected HW key is either the BHK or the DHUK_XOR_BHK, the user application must read it from TAMP
          backup registers before doing any encryption/decryption
    - Use the application key shared by SAES peripheral:
      This key mode aims to let the AES instance receive the key shared by SAES peripheral via secure hardware buses:
        - Call HAL_AES_SetSharedKey() API where the user must set the key size
        - This API is only available with AES peripheral
    - Use the application wrapped key:
      This key mode aims to let the SAES instance secure an application key by encrypting it with SAES Hardware key
      (wrapper key) and when the user intends to use it, he must decrypt it with the same wrapper key. This mode is
      ensured by applying the following sequence:
        - Call HAL_AES_SetHWKey() API where the user must select the SAES hardware key and set its size(Wrapper key),and
          set the key mode to wrapped mode
        - Call HAL_AES_WrapKey() API where the user must provide his application key to be encrypted with the configured
          wrapper key and an output key buffer where to write the encrypted key.
        - When the process ends, the user application must delete the original key to be secure.
        - When need to use the original key, the SAES peripheral must configure the same wrapper key by calling the
          HAL_AES_SetHWKey() API and unwrap the encrypted key by calling HAL_AES_UnwrapKey() API,
          when the process ends the decrypted key can't be read and it's loaded automatically into keys registers
          to be used for further encrypt/decrypt operations.
        - This API is only available with SAES peripheral
      The key size provided by the user as a parameter of HAL_AES_SetHWKey() API must be the same one provided for the
      HAL_AES_WrapKey() and HAL_AES_UnwrapKey() APIs
      When the selected wrapper key is either the BHK or the DHUK_XOR_BHK, the user application must read it from TAMP
      backup registers before calling both APIs HAL_AES_WrapKey() and HAL_AES_UnwrapKey()
  - Step3 (Configure the data swapping):
     - By default, the AES is configured to no swap. If the user provides swapped data he must configure the swap mode
       by using the HAL_AES_SetDataSwapping() API

