STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
- Skipping configuration steps use cases:
  - The step1 Configuration is always required before each one-shot message encrypt or decrypt, but when to encrypt or
    decrypt a single message with consecutive calls of processing API, the user must apply the configuration only before
    processing the first piece of this message.
  - The step2 Configuration is not required as long as the configured key has not been changed (step 2 must be redo
    after ECB or CBC decrypt as those algorithms decryption derivate the original key)
  - The step3 is always required before each one- shot message Encrypt/Decrypt when the provided data are swapped

### Sharing SAES key

The SAES peripheral can share user application keys with AES peripheral without being exposed in clear text.
The key sharing sequence involves both sides(The SAES sharing key peripheral and the AES target peripheral receiving the
shared key):
  - SAES peripheral sharing key:
    - Call HAL_AES_SetHWKey() API where the user must select the SAES hardware key and set its size(Wrapper key),and
      set the key mode to shared mode
    - Call HAL_AES_EncryptSharedKey() API where the user must provide his application key to be encrypted with the
      configured wrapper key and an output key buffer where to write the encrypted key in share mode.
      The user must specify the peripheral receiving the shared key by providing the target_id (target_id value is
      equal to 0 for U5 families)
    - When the process ends, the user application must delete the original key to be secure.
    - When need to share the original key with AES peripheral, the SAES peripheral must configure the same wrapper key
      by calling the HAL_AES_SetHWKey() API and decrypt the encrypted key in share mode using the
      HAL_AES_DecryptSharedKey() API
      when the decryption ends, the decrypted key can't be read and it's loaded automatically into hardware buses and
      shared with AES to be used for further AES encrypt/decrypt operations.
  - AES peripheral target receiving the shared key:
    - On the other side, the receiver of the shared key must be configured via HAL_AES_SetSharedKey() API

The key size provided by the user as a parameter of HAL_AES_SetHWKey() API must be the same one provided for the
HAL_AES_EncryptSharedKey() and HAL_AES_DecryptSharedKey() APIs
When the selected wrapper key is either the BHK or the DHUK_XOR_BHK, the user application must read it from TAMP backup
registers before calling both APIs HAL_AES_EncryptSharedKey() and HAL_AES_DecryptSharedKey()

### Polling mode IO operation

- Encrypt an amount of data in blocking mode using HAL_AES_Encrypt()
- Decrypt an amount of data in blocking mode using HAL_AES_Decrypt()

  - The driver only pads the missing words within a block (One block is equal to four words), when the user provides a
    data size not multiple of words, he must pad the missing bytes within his last word with zeros for GCM and CCM
    algorithms.

### TAG Generation

- Generate tag after encryption or decryption by using either HAL_AES_GCM_GenerateAuthTAG() API for GCM algorithm
  or HAL_AES_CCM_GenerateAuthTAG() API for CCM algorithm

### Interrupt mode IO operation

- Encrypt an amount of data in interrupt mode using HAL_AES_Encrypt_IT()
  - At end of transfer of data between user buffer and AES/SAES peripheral, HAL_AES_InCpltCallback() and
    HAL_AES_OutCpltCallback() are executed
- Decrypt an amount of data in interrupt mode using HAL_AES_Decrypt_IT()
  - At end of transfer of data between user buffer and AES/SAES peripheral, HAL_AES_InCpltCallback() and
    HAL_AES_OutCpltCallback() are executed

  - The driver only pads the missing words within a block (One block is equal to four words), when the user provides a
    data size not multiple of words, he must pad the missing bytes within his last word with zeros for GCM and CCM
    algorithms.

### DMA mode IO operation

- Encrypt/decrypt an amount of data after transfer from input user buffer to AES/SAES peripheral and get
  encrypted / decrypted data from AES/SAES peripheral via DMA using HAL_AES_Encrypt_DMA() or
  HAL_AES_Decrypt_DMA()
  - The minimum data amount transferred with DMA must be equal to one block (four complete words), as the DMA transfer
    does not support the padding(the driver handles the padding with a direct transfer of the incomplete data without
    using the DMA)
  - At the end of a transfer of data from the user buffer to the AES/SAES peripheral, one of these
    callbacks is generated:
    - AES_ECB_CBC_CTR_DMAInCplt() which generates the HAL_AES_InCpltCallback() callback
    - AES_GCM_GMAC_CCM_DMAInCplt() is executed after the header phase blocks transfer to handle the padding if exist and
      to initiate the payload phase in case of plaintext not null. The HAL_AES_InCpltCallback() is then generated

  - At the end of a transfer of data from AES/SAES peripheral to the user buffer, one of these callbacks is
   generated:
     - AES_ECB_CBC_CTR_DMAOutCplt() where the operation is completed and the AES is disabled and which generates the
       HAL_AES_OutCpltCallback() callback
     - AES_GCM_GMAC_CCM_DMAOutCplt() is executed after the payload phase blocks transfer to handle the padding if exist
       and to end the operation by generating the HAL_AES_OutCpltCallback()

  - If a hardware AES DMA error happens during DMA transfer a AES_DMAError() callback is generated to end the operation
    and generates HAL_AES_ErrorCallback()

### Suspend Resume management

The user can resort to the suspend/resume feature for two purposes and under the following conditions:
  - The USE_HAL_AES_SUSPEND_RESUME compilation flag must be defined
  - Suspend conditions:
      - Only IT mode processes can be suspended
      - The suspension is only possible after the completion of processing an entire block
      - The suspension is not possible when one block only lasts to be processed (It's too late to suspend
        the operation)
  - Purpose1(without context modification): Suspend a process due to time constraints and resume it later
      - Call HAL_AES_RequestSuspend() API to request suspension
      - When suspended, a HAL_AES_SuspendCallback callback is generated
      - Call HAL_AES_Resume() API to restore the suspended process from the suspended endpoint
  - Purpose2(with context modification): Suspend a low priority message processing to process a high priority message
    instead
      - Call HAL_AES_RequestSuspend() API to request suspension
      - When suspended, a HAL_AES_SuspendCallback callback is generated
      - Call HAL_AES_SaveContext() API where the user must provide a structure to save in it all the internal data
        needed to restart later on, then the user application must change the context in order to process the
        high priority message (Change the peripheral, the configuration , the AES operation ...)
      - When the high priority message processing is over, call the HAL_AES_RestoreContext() API with the already filled
        structure to restore the low priority suspended context
      - Call HAL_AES_Resume() API to restore the suspended process from the suspended endpoint

