STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
static hal_status_t AES_ECB_CBC_CTR_Process(hal_aes_handle_t *haes, uint32_t timeout_ms);
static void AES_ECB_CBC_CTR_Start_Process_IT(hal_aes_handle_t *haes);
static void AES_ECB_CBC_CTR_Process_IT(hal_aes_handle_t *haes);
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
static hal_status_t AES_ECB_CBC_CTR_Process_DMA(hal_aes_handle_t *haes);
static void AES_ECB_CBC_CTR_DMAInCplt(hal_dma_handle_t *hdma);
static void AES_ECB_CBC_CTR_DMAOutCplt(hal_dma_handle_t *hdma);
#endif /* USE_HAL_AES_DMA */
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
static hal_status_t AES_GCM_GMAC_CCM_Process(hal_aes_handle_t *haes, uint32_t timeout_ms);
static hal_status_t AES_SetInitPhase(hal_aes_handle_t *haes, uint32_t timeout_ms);
static hal_status_t AES_SetHeaderPhase(hal_aes_handle_t *haes, uint32_t timeout_ms);
static hal_status_t AES_SetPayloadPhase(hal_aes_handle_t *haes, uint32_t timeout_ms);
static hal_status_t AES_PaddingData(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                    uint32_t timeout_ms);
static hal_status_t AES_GCM_GMAC_CCM_Start_Process_IT(hal_aes_handle_t *haes);
static hal_status_t AES_SetInitPhase_NonBlocking(hal_aes_handle_t *haes);
static void AES_SetHeaderPhase_IT(hal_aes_handle_t *haes);
static void AES_StartPayloadPhase_IT(hal_aes_handle_t *haes);
static void AES_SetPayloadPhase_IT(hal_aes_handle_t *haes);
static void AES_PaddingData_IT(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes);
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
static hal_status_t AES_GCM_GMAC_CCM_Process_DMA(hal_aes_handle_t *haes);
static hal_status_t AES_SetPayloadPhase_DMA(hal_aes_handle_t *haes);
static hal_status_t AES_SetHeaderPhase_DMA(hal_aes_handle_t *haes);
static hal_status_t AES_PaddingData_DMA(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                        uint32_t latency_clock_cycle);
static void AES_GCM_GMAC_CCM_DMAInCplt(hal_dma_handle_t *hdma);
static void AES_GCM_GMAC_CCM_DMAOutCplt(hal_dma_handle_t *hdma);
#endif /* USE_HAL_AES_DMA */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup AES_Exported_Functions
  * @{
  */

/** @addtogroup AES_Exported_Functions_Group1
  * @{
This subsection provides a set of functions allowing to initialize and de-initialize the AES/SAES
peripheral:
- The HAL_AES_Init() API: Allows initializing the HAL AES driver so it can be configured and used to encrypt
  a plaintext
  or decrypt a ciphertext
  This API is the first API to call when using the HAL AES, it takes 2 parameters as input:
 - The HAL AES handle: A pointer to a @ref hal_aes_handle_t structure
 - The AES instance: A value from the enumeration  @ref hal_aes_t
- The HAL_AES_DeInit() API: Allows de-initializing the HAL AES driver by:
   - Disabling the AES/SAES peripheral
   - Abort DMA input and output transfers
   - De-initializing the current handle object
   - Resetting the handle global state to the **HAL_AES_STATE_RESET**
  */

/**
  * @brief  Initialize the HAL AES handle and associate it to an instance.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  instance          @ref hal_aes_t enumerated type variable to be set according to the physical instance
  * @retval HAL_INVALID_PARAM Invalid param return when the AES handle is NULL
  * @retval HAL_OK            The HAL AES driver is initialized according to the given handle and instance
  */
hal_status_t HAL_AES_Init(hal_aes_handle_t *haes, hal_aes_t instance)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM((IS_AES_ALL_INSTANCE((AES_TypeDef *)(uint32_t)instance))
                   || (IS_SAES_ALL_INSTANCE((AES_TypeDef *)(uint32_t)instance)));

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  haes->instance = instance;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_in_cplt_cb  = HAL_AES_InCpltCallback;  /* Input FIFO transfer completed callback */
  haes->p_out_cplt_cb = HAL_AES_OutCpltCallback; /* Output FIFO transfer completed callback */
  haes->p_error_cb    = HAL_AES_ErrorCallback;
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  haes->p_suspend_cb  = HAL_AES_SuspendCallback;
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

#if defined(USE_HAL_AES_USER_DATA) && (USE_HAL_AES_USER_DATA == 1)
  haes->p_user_data = NULL;
#endif /* (USE_HAL_AES_USER_DATA) */

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1U)
  haes->hdma_in = (hal_dma_handle_t *)NULL;
  haes->hdma_out = (hal_dma_handle_t *)NULL;
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_CLK_ENABLE_MODEL) && (USE_HAL_AES_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  if (haes->instance == HAL_AES)
  {
    HAL_RCC_AES_EnableClock();
  }
  else
  {
    HAL_RCC_RNG_EnableClock();
    HAL_RCC_SAES_EnableClock();
  }
#endif /* USE_HAL_AES_CLK_ENABLE_MODEL */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  haes->suspend_request = AES_SUSPEND_NONE;
#endif /* USE_HAL_AES_SUSPEND_RESUME */
  haes->global_state = HAL_AES_STATE_INIT;
  return HAL_OK;
}

/**
  * @brief  De-initialize the AES/SAES peripheral.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
void HAL_AES_DeInit(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)) || IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
  uint32_t tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);

  if (tmp  != 0U)
  {
    /* Disable the DMA transfer */
    CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);

    /* Disable the DMA transmit on the DMA side */
    (void)HAL_DMA_Abort(haes->hdma_in);

    /* Disable the DMA receive on the DMA side */
    (void)HAL_DMA_Abort(haes->hdma_out);
  }
#endif /* USE_HAL_AES_DMA */

  AES_DISABLE(haes);

