STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
  /* Set IPRST for software reset */
  SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_IPRST);

  /* Clear IPRST to allow writing registers */
  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_IPRST);

  haes->global_state = HAL_AES_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup AES_Exported_Functions_Group2
  * @{
This subsection provides a set of functions allowing to configure the AES/SAES peripheral through
three steps:
- Step1: Chaining mode(algorithm) configuration APIs:
       - HAL_AES_ECB_SetConfig()      :Allowing to configure the AES/SAES peripheral with the ECB algorithm
       - HAL_AES_CBC_SetConfig()      :Allowing to configure the AES/SAES peripheral with the CBC algorithm
       - HAL_AES_CTR_SetConfig()      :Allowing to configure the AES peripheral with the CTR algorithm
       - HAL_AES_GCM_GMAC_SetConfig() :Allowing to configure the AES peripheral with the GCM_GMAC algorithms
       - HAL_AES_CCM_SetConfig()      :Allowing to configure the AES peripheral with the CCM algorithm
- Step2: Key configuration APIs:
       - HAL_AES_SetNormalKey()       :Allowing to configure the application normal key
       - HAL_AES_SetHWKey()           :Allowing to configure the SAES peripheral hardware key for normal, wrap or share
                                       mode use
       - HAL_AES_SetSharedKey()       :Allowing to configure the AES peripheral shared key
- Step3: Data swapping mode configuration APIs:
       - HAL_AES_SetDataSwapping()    :Allowing to configure the data swapping mode
       - HAL_AES_GetDataSwapping()    :Allowing to retrieve the data swapping mode
- Other configuration APIs:
   - HAL_AES_EnableKeyProtection()    :Allowing to protect the SAES key from being accessed by another peripheral
   - HAL_AES_DisableKeyProtection()   :Allowing to disable the SAES key protection
   - HAL_AES_IsEnabledKeyProtection() :Allowing to check if the SAES key protection is enabled or disabled
  */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/**
  * @brief  Configure the AES/SAES peripheral with ECB algorithm.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @note   The user has not to set any parameter
  * @retval HAL_INVALID_PARAM Invalid param return when the AES handle is NULL
  * @retval HAL_ERROR Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK    AES/SAES peripheral has been correctly configured with ECB algorithm
  */
hal_status_t HAL_AES_ECB_SetConfig(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Fetch random numbers from RNG after enabling RNG and SAES clocks, SAES supports only ECB and CBC algorithms */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if ((haes->instance == (uint32_t)SAES_S) || (haes->instance == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
    if (AES_RNGFetchGetStatus(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  AES_DISABLE(haes);
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_KEYSEL | AES_CR_DATATYPE, AES_ALGORITHM_ECB);

  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_ECB;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Configure the AES/SAES peripheral with CBC algorithm.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_init_vect       Pointer to **const uint32_t** four words buffer provided by the user. For CBC algorithm,
  *                           the init vector is used to process only the first data block
  * @retval HAL_INVALID_PARAM Invalid param return when the provided init vector pointer or handle pointer is null
  * @retval HAL_ERROR         Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK            AES/SAES peripheral has been correctly configured with CBC algorithm
  */
hal_status_t HAL_AES_CBC_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_init_vect != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_init_vect == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Fetch random numbers from RNG after enabling RNG and SAES clocks, SAES supports only ECB and CBC algorithms */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if ((haes->instance == (uint32_t)SAES_S) || (haes->instance == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
    if (AES_RNGFetchGetStatus(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  AES_DISABLE(haes);
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_KEYSEL | AES_CR_DATATYPE, AES_ALGORITHM_CBC);

  AES_SetIV(haes, p_init_vect);

  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CBC;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Configure the SAES Hardware key.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  key_select        key selection with a **hal_aes_key_select_t** type
  * @param  key_mode          key mode with a **hal_aes_key_mode_t** type
  * @retval HAL_INVALID_PARAM Invalid param return when the handle instance is other than SAES or the handle pointer
  *                           is null
  * @retval HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval HAL_OK            Hardware key has been configured
  */
hal_status_t HAL_AES_SetHWKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, hal_aes_key_select_t key_select,
                              hal_aes_key_mode_t key_mode)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_PARAM(IS_AES_KEY_SELECT(key_select));
  ASSERT_DBG_PARAM(IS_AES_KEY_MODE(key_mode));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

