STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes->instance != HAL_SAES)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_AES_ClearFlagKERR(haes);

  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSEL | AES_CR_KEYSIZE | AES_CR_KMOD,
             (uint32_t)key_select | (uint32_t)key_size | (uint32_t)key_mode);

  if (AES_WaitForSetKey(haes) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Enable the protection of the SAES key from being accessed by another security context application.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_INVALID_PARAM Invalid param return when the handle instance is other than SAES or the handle pointer
  *                           is null
  * @retval HAL_OK            SAES key protection has been enabled
  */
hal_status_t HAL_AES_EnableKeyProtection(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes->instance != HAL_SAES)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  AES_DISABLE(haes);
  SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYPROT);

  return HAL_OK;
}

/**
  * @brief  Disable the SAES key protection.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_INVALID_PARAM Invalid param return when the handle instance is other than SAES or the handle pointer
  *                           is null
  * @retval HAL_OK            SAES key protection has been disabled
  */
hal_status_t HAL_AES_DisableKeyProtection(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes->instance != HAL_SAES)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  AES_DISABLE(haes);
  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYPROT);

  return HAL_OK;
}

/**
  * @brief  Check whether the SAES key protection is already enabled or not.
  * @param  haes                            Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_AES_KEY_PROTECTION_ENABLED  The SAES key protection is enabled
  * @retval HAL_AES_KEY_PROTECTION_DISABLED The SAES key protection is disabled
  */
hal_aes_key_protection_status_t HAL_AES_IsEnabledKeyProtection(const hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

  return ((READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYPROT) != 0U) ? HAL_AES_KEY_PROTECTION_ENABLED
          : HAL_AES_KEY_PROTECTION_DISABLED);
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)
/**
  * @brief  Configure the AES peripheral with the CTR algorithm, available only with AES instance.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_init_vect       Pointer to **const uint32_t** four words buffer provided by the user. For CTR algorithm,
  *                           the init vector is used to process each data block
  * @retval HAL_INVALID_PARAM Invalid param return when the provided init vector pointer is null or the handle pointer
  *                           is null
  *                           or the handle instance is not HAL_AES
  * @retval HAL_OK            AES peripheral has been correctly configured with the CTR algorithm
  */
hal_status_t HAL_AES_CTR_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(p_init_vect != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_init_vect == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (haes->instance != HAL_AES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  AES_DISABLE(haes);
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE, AES_ALGORITHM_CTR);

  AES_SetIV(haes, p_init_vect);

  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CTR;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_CTR_ALGO */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
/**
  * @brief  Configure the AES peripheral with the GCM_GMAC algorithm, available only with AES instance.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_config          Pointer to a @ref hal_aes_gcm_config_t structure that contains the AES configuration with
  *                           GCM_GMAC algorithms
  * @retval HAL_INVALID_PARAM  Invalid param return when:
  *                           - The configuration structure pointer is null
  *                           - The provided init vector pointer within the configuration structure is null
  *                           - The provided header within the configuration structure is null but its size is not null
  *                           - The handle pointer is null
  *                           - The handle instance is not HAL_AES
  * @retval HAL_OK            AES peripheral has been correctly configured with the GCM_GMAC algorithm
  */
hal_status_t HAL_AES_GCM_GMAC_SetConfig(hal_aes_handle_t *haes, const hal_aes_gcm_config_t *p_config)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_init_vect != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

