STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_init_vect == NULL) || ((p_config->p_header == NULL)
                                                                && (p_config->header_size_byte != 0U)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (haes->instance != HAL_AES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  AES_DISABLE(haes);
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE | AES_CR_GCMPH | AES_CR_NPBLB,
             AES_ALGORITHM_GCM_GMAC);

  AES_SetIV(haes, p_config->p_init_vect);

  haes->p_header = p_config->p_header;
  haes->header_size_byte = p_config->header_size_byte;
  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_GCM_GMAC;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_GCM_GMAC_ALGO */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
/**
  * @brief  Configure the AES with the CCM algorithm, available only with AES instance.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_config          Pointer to a @ref hal_aes_ccm_config_t structure
  * @retval HAL_INVALID_PARAM Invalid param return when:
  *                           - The configuration structure pointer is null
  *                           - The provided b0 within the configuration structure is null
  *                           - The provided header within the configuration structure is null but its size is not null
  *                           - The handle pointer is null
  *                           - The handle instance is not HAL_AES
  * @retval HAL_OK            AES peripheral has been correctly configured with the CCM algorithm
  */
hal_status_t HAL_AES_CCM_SetConfig(hal_aes_handle_t *haes, const hal_aes_ccm_config_t *p_config)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_b0 != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_b0 == NULL) || ((p_config->p_header == NULL)
                                                         && (p_config->header_size_byte != 0U)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (haes->instance != HAL_AES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  AES_DISABLE(haes);
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE | AES_CR_GCMPH | AES_CR_NPBLB,
             AES_ALGORITHM_CCM);

  AES_SetIV(haes, p_config->p_b0);

  haes->p_header = p_config->p_header;
  haes->header_size_byte = p_config->header_size_byte;
  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CCM;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_CCM_ALGO */

/**
  * @brief  Configure the AES Normal key(key size, key value), supports both AES and SAES instances.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  p_key             A **uint32_t** AES key that must be coherent with the **key_size**
  * @retval HAL_INVALID_PARAM Invalid param return when the provided pointer key is null or the handle
  *                           pointer is null
  * @retval HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval HAL_OK            Normal key has been configured
  */
hal_status_t HAL_AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_key != NULL);
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_key == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_AES_ClearFlagKERR(haes);

  if (haes->instance == HAL_AES)
  {
    MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSIZE, (uint32_t)key_size);
  }
  else
  {
    MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSIZE | AES_CR_KEYSEL, (uint32_t)key_size);
  }

  AES_SetNormalKey(haes, key_size, p_key);

  if (AES_WaitForSetKey(haes) != HAL_OK)
  {
    return HAL_ERROR;
  }

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  haes->p_key = p_key;
#endif /* USE_HAL_AES_SUSPEND_RESUME */

  return HAL_OK;
}

/**
  * @brief  Configure the AES shared key mode to acquire the key shared by the SAES peripheral.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @warning The configured size must be the same as the size of the shared key
  * @retval  HAL_INVALID_PARAM Invalid param return when the handle instance is other than AES or the handle
  *                            pointer is null
  * @retval  HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval  HAL_OK            Normal key has been configured
  */
hal_status_t HAL_AES_SetSharedKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

