STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    if ((p_input == NULL) || (p_output == NULL) || (size_byte == 0U))
    {
      return HAL_INVALID_PARAM;
    }
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    if ((p_input == NULL) && (size_byte != 0U))
    {
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
  data_size_sum_byte_tmp = haes->data_size_sum_byte;

  if (
    ((haes->algorithm == AES_ALGORITHM_ECB)
     || (haes->algorithm == AES_ALGORITHM_CBC))
    && (data_size_sum_byte_tmp  == 0U)
  )
  {
    if (AES_KeyDerivation(haes) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_ERROR;
    }
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  /* Set decrypt mode
     SAES key mode must be normal to do decryption with any key:
     SAES configurable keys (normal,HW)
     or using a wrapped key
     or using a shared key (unshare)
     AES key mode must be normal when encrypt/decrypt */
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT);

  haes->p_in_buff = (const uint32_t *)p_input;
  haes->p_out_buff = (uint32_t *)p_output;
  haes->data_size_byte = size_byte;
  haes->block_count = 0U;

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    if (AES_ECB_CBC_CTR_Process_DMA(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    if (AES_GCM_GMAC_CCM_Process_DMA(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }

  return HAL_OK;
}
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/**
  * @brief  Request suspension for AES interrupt mode processing.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @note   Set the handle field suspend_request to HAL_AES_SUSPEND so that the on-going AES processing is suspended as
  *         soon as the required conditions are met (The current block is entirely processed and it's not the last one)
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_OK            The AES processing suspension is well requested
  */
hal_status_t HAL_AES_RequestSuspend(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_ACTIVE);
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  haes->suspend_request = AES_SUSPEND;

  return HAL_OK;
}

/**
  * @brief  Resumption of the suspended AES processing.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @note   Processing restarts at the exact point where it was suspended, if the AES context has been changed
  *         @ref HAL_AES_SaveContext and @ref HAL_AES_RestoreContext must be used before resumption.
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_OK            AES suspended processing is resumed
  */
hal_status_t HAL_AES_Resume(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_SUSPENDED);
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_SUSPENDED, HAL_AES_STATE_ACTIVE);

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) || (haes->algorithm == AES_ALGORITHM_CCM))
  {
    AES_ENABLE(haes);

    if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_HEADER)
    {
      AES_SetHeaderPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
    else
    {
      AES_StartPayloadPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }
  else
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  {
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))

    /* Enable interrupts and Process one block to generate the computation complete interrupt */
    AES_ECB_CBC_CTR_Start_Process_IT(haes);

#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  }

  return HAL_OK;
}

/**
  * @brief  Save parameters of the suspended AES processing.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @param  p_context Pointer to a @ref hal_aes_save_context_t structure where to store the parameters of the suspend
  *                   AES processing
  * @retval HAL_INVALID_PARAM The provided save context pointer structure or the handle pointer is null
  * @retval HAL_OK            AES suspended processing parameters are saved
  */
hal_status_t HAL_AES_SaveContext(hal_aes_handle_t *haes, hal_aes_save_context_t *p_context)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_context != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_SUSPENDED);

