STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_context == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) || (haes->algorithm == AES_ALGORITHM_CCM))
  {
    p_context->SUSPxR[0] = AES_GET_INSTANCE(haes)->SUSP7R;
    p_context->SUSPxR[1] = AES_GET_INSTANCE(haes)->SUSP6R;
    p_context->SUSPxR[2] = AES_GET_INSTANCE(haes)->SUSP5R;
    p_context->SUSPxR[3] = AES_GET_INSTANCE(haes)->SUSP4R;
    p_context->SUSPxR[4] = AES_GET_INSTANCE(haes)->SUSP3R;
    p_context->SUSPxR[5] = AES_GET_INSTANCE(haes)->SUSP2R;
    p_context->SUSPxR[6] = AES_GET_INSTANCE(haes)->SUSP1R;
    p_context->SUSPxR[7] = AES_GET_INSTANCE(haes)->SUSP0R;
  }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

  if (haes->algorithm != AES_ALGORITHM_ECB)
  {
    /* Save Initialization Vector registers */
    p_context->iv_buff[0] = AES_GET_INSTANCE(haes)->IVR3;
    p_context->iv_buff[1] = AES_GET_INSTANCE(haes)->IVR2;
    p_context->iv_buff[2] = AES_GET_INSTANCE(haes)->IVR1;
    p_context->iv_buff[3] = AES_GET_INSTANCE(haes)->IVR0;
  }

  AES_DISABLE(haes);

  /* Save the configuration register */
  p_context->CR = AES_GET_INSTANCE(haes)->CR;
  p_context->instance           = haes->instance;
  p_context->previous_state     = haes->global_state;
  p_context->algorithm          = haes->algorithm;
  p_context->data_size_byte     = haes->data_size_byte;
  p_context->data_size_sum_byte = haes->data_size_sum_byte;
  p_context->p_in_buff          = haes->p_in_buff;
  p_context->p_out_buff         = haes->p_out_buff;
  p_context->block_count        = haes->block_count;
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  p_context->p_header           = haes->p_header;
  p_context->header_size_byte   = haes->header_size_byte;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  p_context->suspend_request    = haes->suspend_request;
  p_context->p_key              = haes->p_key;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  p_context->p_in_cplt_cb       = haes->p_in_cplt_cb;
  p_context->p_out_cplt_cb      = haes->p_out_cplt_cb;
  p_context->p_error_cb         = haes->p_error_cb;
  p_context->p_suspend_cb       = haes->p_suspend_cb;
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

  haes->global_state = HAL_AES_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Resumption for the saved parameters of the suspended AES processing.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @param  p_context Pointer to a @ref hal_aes_save_context_t structure where the parameters of the suspend AES
  *                   processing are stored
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_ERROR         AES key derivation exceeds the dedicated timeout
  * @retval HAL_OK            AES suspended processing parameters are restored
  */
hal_status_t HAL_AES_RestoreContext(hal_aes_handle_t *haes, const hal_aes_save_context_t *p_context)
{
  uint32_t key_size;

  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_context != NULL);
  ASSERT_DBG_PARAM(p_context->previous_state == HAL_AES_STATE_SUSPENDED);

  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  AES_DISABLE(haes);

  AES_GET_INSTANCE(haes)->CR = p_context->CR;

  haes->instance           = p_context->instance;
  haes->algorithm          = p_context->algorithm;
  haes->data_size_byte     = p_context->data_size_byte;
  haes->data_size_sum_byte = p_context->data_size_sum_byte;
  haes->p_in_buff          = p_context->p_in_buff;
  haes->p_out_buff         = p_context->p_out_buff;
  haes->block_count        = p_context->block_count;

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  haes->p_header           = p_context->p_header;
  haes->header_size_byte   = p_context->header_size_byte;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  haes->suspend_request    = p_context->suspend_request;
  haes->p_key              = p_context->p_key;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_in_cplt_cb       = p_context->p_in_cplt_cb;
  haes->p_out_cplt_cb      = p_context->p_out_cplt_cb;
  haes->p_error_cb         = p_context->p_error_cb;
  haes->p_suspend_cb       = p_context->p_suspend_cb;
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

  key_size = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSIZE);

  if (haes->algorithm != AES_ALGORITHM_ECB)
  {
    AES_SetIV(haes, p_context->iv_buff);
  }

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSEL) == 0U)
  {
    AES_SetNormalKey(haes, (hal_aes_key_size_t)key_size, haes->p_key);
  }

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
  if ((READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE) == AES_OPERATING_MODE_DECRYPT)
      && ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)))
  {
    if (AES_KeyDerivation(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }

    MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT);
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) || (haes->algorithm == AES_ALGORITHM_CCM))
  {
    AES_GET_INSTANCE(haes)->SUSP7R = p_context->SUSPxR[0];
    AES_GET_INSTANCE(haes)->SUSP6R = p_context->SUSPxR[1];
    AES_GET_INSTANCE(haes)->SUSP5R = p_context->SUSPxR[2];
    AES_GET_INSTANCE(haes)->SUSP4R = p_context->SUSPxR[3];
    AES_GET_INSTANCE(haes)->SUSP3R = p_context->SUSPxR[4];
    AES_GET_INSTANCE(haes)->SUSP2R = p_context->SUSPxR[5];
    AES_GET_INSTANCE(haes)->SUSP1R = p_context->SUSPxR[6];
    AES_GET_INSTANCE(haes)->SUSP0R = p_context->SUSPxR[7];
  }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

  haes->global_state = HAL_AES_STATE_SUSPENDED;

  return HAL_OK;
}
#endif /* USE_HAL_AES_SUSPEND_RESUME */
/**
  * @}
  */

