STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_key_in == NULL) || (haes->instance != HAL_SAES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  if (AES_KeyDerivation(haes) != HAL_OK)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  /* Decrypt the SAES application normal key with the unwrapper key already set by HAL_AES_SetHWKey() API in wrap mode:
    The SAES application key becomes usable (decrypted) and can be used to encrypt/decrypt SAES messages */
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT
             | (uint32_t)HAL_AES_KEY_MODE_WRAPPED);

  haes->p_in_buff = p_key_in;

  if (key_size == HAL_AES_KEY_SIZE_128BIT)
  {
    haes->data_size_byte = 16U;
  }
  else
  {
    haes->data_size_byte = 32U;
  }
  haes->block_count = 0U;

  if (AES_ECB_CBC_CTR_Process(haes, timeout_ms) != HAL_OK)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/**
  * @brief  Encrypt an application key to be shared with AES peripheral, using SAES HW key. \n
  *         This API is only available with SAES instance,
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_key_in          Pointer to **uint32_t** input key provided by the user to be encrypted
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  p_key_output      Pointer to **uint32_t** output key provided by the user to be filled with the encrypted
  *                           application key
  * @param  target_id        Specify which AES target can receive the SAES shared key
  *                          00: AES peripheral
  * @param  timeout_ms       Specify Timeout value in milliseconds
  * @note   This API aims to build a secure application context following this sequence:
  *       - Call HAL_AES_EncryptSharedKey() API to encrypt the application key and write it into the output key buffer
  *       - Delete the original key at the application level
  *       - When need to share the original application key with the specified AES target, call the
  *         HAL_AES_DecryptSharedKey() API which decrypts the encrypted key using the same SAES HW keys (wrapper key)
  *         and automatically transfers the unreadable result to the target via secure HW buses. This target must be
  *         configured with the HAL_AES_SetSharedKey() API, then the target keys registers are loaded automatically with
  *         the transferred key.
  * @warning The key size must be the same one as the wrapper key which is provided as a parameter of the
             HAL_AES_SetHWKey() API
  * @retval HAL_INVALID_PARAM Invalid param return when:
  *                           - The handle instance is not the SAES one
  *                           - The provided application input key pointer is null
  *                           - The provided application output key pointer is null
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_ERROR         Error return when the selected wrapper key is invalid
  * @retval HAL_TIMEOUT       AES key wrapping exceeds user timeout
  * @retval HAL_OK            AES key wrapping is successfully accomplished
  */
hal_status_t HAL_AES_EncryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t *p_key_output, uint32_t target_id, uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(p_key_in != NULL);
  ASSERT_DBG_PARAM(IS_AES_HW_KEY_SIZE(haes, key_size));
  ASSERT_DBG_PARAM(p_key_output != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_key_in == NULL) || (p_key_output == NULL) || (haes->instance != HAL_SAES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  /* Encrypt the SAES application key with the wrapper key already set by HAL_AES_SetHWKey() API in share mode: The SAES
  application key becomes protected(encrypted) and can be shared only after being decrypted with the same wrapper key */
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD | AES_CR_KSHAREID,
             AES_OPERATING_MODE_ENCRYPT | (uint32_t)HAL_AES_KEY_MODE_SHARED | target_id);

  haes->p_in_buff = p_key_in;
  haes->p_out_buff = p_key_output;

  if (key_size == HAL_AES_KEY_SIZE_128BIT)
  {
    haes->data_size_byte = 16U;
  }
  else
  {
    haes->data_size_byte = 32U;
  }
  haes->block_count = 0U;

  if (AES_ECB_CBC_CTR_Process(haes, timeout_ms) != HAL_OK)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Decrypt an application key to be shared with AES peripheral with the same SAES HW key (wrapper key)
  *         used by the HAL_AES_EncryptSharedKey() API. \n
  *         This API is only available with SAES instance.
  * @param  haes             Pointer to a @ref hal_aes_handle_t structure
  * @param  p_key_in         Pointer to **uint32_t** input key provided by the user to be encrypted
  *                          parameters of the application key and the selected wrapper key (The key to be used to
  *                          encrypt the key application)
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  target_id        Specify which target can read the SAES key registers after a decryption
  *                          00: AES peripheral
  * @param  timeout_ms        Specify Timeout value in milliseconds
  * @note   This API aims to build a secure application context following this sequence:
  *       - Call HAL_AES_EncryptSharedKey() API to encrypt the application key and write it into the output key buffer
  *       - Delete the original key at the application level
  *       - When need to share the original application key with the specified AES target, call the
  *         HAL_AES_DecryptSharedKey() API which decrypts the encrypted key using the same SAES HW keys (wrapper key)
  *         and automatically transfers the unreadable result to the target via secure HW buses. This target must be
  *         configured with the HAL_AES_SetSharedKey() API, then the target keys registers are loaded automatically with
  *         the transferred key.
  * @warning The key size must be the same one as the wrapper key which is provided as a parameter of the
             HAL_AES_SetHWKey() API
  * @retval HAL_INVALID_PARAM Invalid param return when:
  *                           - The handle instance is not the SAES one
  *                           - The provided application input key pointer is null
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_ERROR         Error return when the selected wrapper key is invalid or when the key derivation exceeds
  *                           the dedicated timeout
  * @retval HAL_TIMEOUT       AES key unwrapping exceeds user timeout
  * @retval HAL_OK            AES key unwrapping is successfully accomplished
  */
hal_status_t HAL_AES_DecryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t target_id, uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(p_key_in != NULL);
  ASSERT_DBG_PARAM(IS_AES_HW_KEY_SIZE(haes, key_size));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

