STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_key_in == NULL) || (haes->instance != HAL_SAES))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  if (AES_KeyDerivation(haes) != HAL_OK)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  /* Decrypt the SAES application normal key with the unwrapper key already set by HAL_AES_SetHWKey() API in share mode:
     The SAES application key becomes shareable and can be shared with AES peripherals to encrypt/decrypt messages */
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD | AES_CR_KSHAREID,
             AES_OPERATING_MODE_DECRYPT | (uint32_t)HAL_AES_KEY_MODE_SHARED | target_id);

  haes->p_in_buff = p_key_in;

  if (key_size == HAL_AES_KEY_SIZE_128BIT)
  {
    haes->data_size_byte = 16U;
  }
  else
  {
    haes->data_size_byte = 32U;
  }
  haes->block_count = 0U;

  if (AES_ECB_CBC_CTR_Process(haes, timeout_ms) != HAL_OK)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */
/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup AES_Private_Functions
  * @{
This subsection provides a set of functions allowing to:
 - Perform configuration operations:
  - AES_SetNormalKey()                 :Allowing to load the key into keys registers
  - AES_WaitForSetKey()                :Allowing to wait for the key to be loaded into keys registers
  - AES_SetIV()                        :Allowing to load the initial vector into IV registers
  - AES_RNGFetchGetStatus()            :Allowing to get status of random numbers fetched from RNG for (SAES only)
 - Manage data transfer between user buffers and the AES/SAES peripheral:
  - AES_ProcessOneblock()              :Allowing to process one block of data(Four words)
  - AES_WaitOnCCFlag()                 :Allowing to Wait for the Computation complete in blocking mode
  - AES_WaitOnCCFlag_NonBlocking()     :Allowing to wait for computation complete flag in non blocking mode
  - AES_KeyDerivation()                :Allowing to derivate the key before performing an ECB/CBC decryption
  - AES_ECB_CBC_CTR_Process()          :Allowing to process data for ECB/CBC/CTR algorithms in polling mode
  - AES_ECB_CBC_CTR_Start_Process_IT() :Allowing to start the ECB/CBC/CTR IT process
  - AES_ECB_CBC_CTR_Process_IT()       :Allowing to process data for ECB/CBC/CTR algorithms in IT mode
  - AES_ECB_CBC_CTR_Process_DMA()      :Allowing to process data for ECB/CBC/CTR algorithms in dma mode
  - AES_ECB_CBC_CTR_DMAInCplt()        :Allowing to manage the DMA input transfer complete callback for ECB/CBC/CTR
  - AES_ECB_CBC_CTR_DMAOutCplt()       :Allowing to manage the DMA output transfer complete callback for ECB/CBC/CTR
  - AES_DMAError()                     :Allowing to manage the DMA error callback
  - AES_GCM_GMAC_CCM_Process()         :Allowing to process data for GCM_GMAC/CCM algorithms in polling mode
  - AES_SetInitPhase()                 :Allowing to perform the INIT phase for GCM_GMAC/CCM algorithms in polling mode
  - AES_SetHeaderPhase()               :Allowing to perform the HEADER phase for GCM_GMAC/CCM algorithms in polling mode
  - AES_SetPayloadPhase()              :Allowing to perform the PAYLOAD phase for GCM_GMAC/CCM algorithms in polling
                                        mode
  - AES_PaddingData()                  :Allowing to perform the data padding for GCM_GMAC/CCM algorithms in polling mode
  - AES_GCM_GMAC_CCM_Start_Process_IT():Allowing to start the GCM_GMAC/CCM IT process
  - AES_SetInitPhase_NonBlocking()     :Allowing to perform the INIT phase for GCM_GMAC/CCM in non blocking mode
  - AES_StartPayloadPhase_IT()         :Allowing to start the GCM_GMAC/CCM IT PAYLOAD phase
  - AES_SetHeaderPhase_IT()            :Allowing to perform the HEADER phase for GCM_GMAC/CCM algorithms in IT mode
  - AES_SetPayloadPhase_IT()           :Allowing to perform the PAYLOAD phase for GCM_GMAC/CCM algorithms in IT mode
  - AES_PaddingData_IT()               :Allowing to perform the data padding for GCM_GMAC/CCM algorithms in IT mode
  - AES_GCM_GMAC_CCM_Process_DMA()     :Allowing to process data for GCM_GMAC/CCM algorithms in dma mode
  - AES_GCM_GMAC_CCM_DMAInCplt()       :Allowing to manage the DMA input transfer complete callback for GCM_GMAC/CCM
  - AES_GCM_GMAC_CCM_DMAOutCplt()      :Allowing to manage the DMA output transfer complete callback for GCM_GMAC/CCM
  - AES_PaddingData_DMA()              :Allowing to perform the data padding for GCM_GMAC/CCM algorithms in DMA mode
  */
/**
  * @brief  Load the AES application key into key registers.
  * @param  haes     Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size AES key size with a **hal_aes_key_size_t** type
  * @param  p_key    A **uint32_t** AES key that must be odd and coherent with the **key_size**
  */
static void AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key)
{
  if (key_size == HAL_AES_KEY_SIZE_256BIT)
  {
    AES_GET_INSTANCE(haes)->KEYR7 = *(const uint32_t *)(p_key);
    AES_GET_INSTANCE(haes)->KEYR6 = *(const uint32_t *)(p_key + 1U);
    AES_GET_INSTANCE(haes)->KEYR5 = *(const uint32_t *)(p_key + 2U);
    AES_GET_INSTANCE(haes)->KEYR4 = *(const uint32_t *)(p_key + 3U);
    AES_GET_INSTANCE(haes)->KEYR3 = *(const uint32_t *)(p_key + 4U);
    AES_GET_INSTANCE(haes)->KEYR2 = *(const uint32_t *)(p_key + 5U);
    AES_GET_INSTANCE(haes)->KEYR1 = *(const uint32_t *)(p_key + 6U);
    AES_GET_INSTANCE(haes)->KEYR0 = *(const uint32_t *)(p_key + 7U);
  }
  else
  {
    AES_GET_INSTANCE(haes)->KEYR3 = *(const uint32_t *)(p_key);
    AES_GET_INSTANCE(haes)->KEYR2 = *(const uint32_t *)(p_key + 1U);
    AES_GET_INSTANCE(haes)->KEYR1 = *(const uint32_t *)(p_key + 2U);
    AES_GET_INSTANCE(haes)->KEYR0 = *(const uint32_t *)(p_key + 3U);
  }
}

/**
  * @brief  Wait for the AES application key to be loaded into key registers.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @note   This is only a key loading without a check for its validity. This check must be done inside the process
  * @retval HAL_ERROR   AES key loading into key registers exceeds the general timeout
  * @retval HAL_OK      AES key loading into key registers is accomplished
  */
static hal_status_t AES_WaitForSetKey(hal_aes_handle_t *haes)
{
  uint32_t tickstart;

  /* Wait for Key to be completely loaded */
  tickstart = HAL_GetTick();
  while (HAL_AES_GetFlag(haes, HAL_AES_FLAG_BUSY) != 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > AES_GENERAL_TIMEOUT_MS)
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

