STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
  if (AES_WaitOnCCFlag_NonBlocking(haes, key_derivation_latency) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
 || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
/**
  * @brief  Process all user data by blocks from the user input buffer to the input data register and from the output
  *         data register to the output data buffer. \n
  *         The Padding is not supported.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_ECB_CBC_CTR_Process(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  uint32_t data_block_numbers = (haes->data_size_byte + 15U) / 16U;
  uint32_t block_count;
  uint32_t data_size_sum_byte_tmp;

  AES_ENABLE(haes);

  for (block_count = haes->block_count; block_count < data_block_numbers; block_count++)
  {
    haes->block_count = block_count;
    if (AES_ProcessOneblock(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

  AES_DISABLE(haes);

  data_size_sum_byte_tmp = haes->data_size_sum_byte;
  haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

  return HAL_OK;
}

/**
  * @brief Enable interrupts and Process one block from the user input buffer to the input data register. \n
  *        Once processed, a computation complete interrupt is then generated, the program enters the IRQHandler, reads
  *        the encrypted block from the output data register and performs the write of a new block, then a second
  *        interrupt is generated.
  * @param haes  Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_ECB_CBC_CTR_Start_Process_IT(hal_aes_handle_t *haes)
{
  uint32_t block_count = haes->block_count;

  AES_ENABLE(haes);

  /* Write one first block(4 words), then a computation Complete interrupt is generated */
  for (uint32_t i = 0U; i < 4U ; i++)
  {
    AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)(haes->p_in_buff + (block_count * 4U) + i);
  }

  HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if ((haes->instance == (uint32_t)SAES_S) || (haes->instance == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
    HAL_AES_EnableIT(haes, HAL_AES_IT_RNGERR);
  }
}

/**
  * @brief AES interrupt process for ECB, CBC and CTR algorithms. \n
  *        Once a computation complete interrupt is generated, t, the program enters the IRQHandler, reads the
  *        encrypted block from the output data register and performs the write of a new block, then a second interrupt
  *        is generated. \n
  *        The Padding is not supported.
  * @param  haes  Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_ECB_CBC_CTR_Process_IT(hal_aes_handle_t *haes)
{
  uint32_t data_block_numbers = ((haes->data_size_byte + 15U) / 16U);
  uint32_t block_count = haes->block_count;
  uint32_t offset = block_count * 4U;
  uint32_t temp[4] = {0};
  uint32_t i;
  uint32_t data_size_sum_byte_tmp;

  /* Read from DOUTR */
  if (block_count < data_block_numbers)
  {
    /* The wrapped SAES application key can be used(encrypt/decrypt messages) only when it is decrypted but it must
       stay secret and can't be read after decryption */
    if (READ_BIT(AES_GET_INSTANCE(haes)->CR,
                 AES_CR_MODE | AES_CR_KMOD) != (AES_OPERATING_MODE_DECRYPT | (uint32_t)HAL_AES_KEY_MODE_WRAPPED))
      /* Read from DOUTR after each computation complete interrupt: Start to read the first block processed
         via AES_ECB_CBC_CTR_Start_Process_IT */
    {
      for (i = 0U; i < 4U ; i++)
      {
        temp[i] = AES_GET_INSTANCE(haes)->DOUTR;
      }
      i = 0U;
      while ((offset < ((haes->data_size_byte + 3U) / 4U)) && (i < 4U))
      {
        *(uint32_t *)(haes->p_out_buff + offset) = temp[i];
        offset++;
        i++;
      }
    }

    /* Disable interrupts when all the data is processed (The padding is not supported for those algorithms) */
    if (block_count == (data_block_numbers - 1U))
    {
      data_size_sum_byte_tmp = haes->data_size_sum_byte;
      haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
      if ((haes->instance == (uint32_t)SAES_S) || (haes->instance == (uint32_t)SAES_NS))
#else
      if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
      {
        HAL_AES_DisableIT(haes, HAL_AES_IT_RNGERR);
      }

      AES_DISABLE(haes);

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_out_cplt_cb(haes);
#else
      HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }

  /* New block to be processed */
  block_count++;
  haes->block_count = block_count;

  /* Write to DINR generates a computation complete interrupt */
  if (block_count < data_block_numbers)
  {
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
    /* A suspension is already requested */
    if (haes->suspend_request == AES_SUSPEND)
    {
      HAL_AES_ClearFlagCC(haes);

      haes->suspend_request = AES_SUSPEND_NONE;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
      if ((haes->instance == (uint32_t)SAES_S) || (haes->instance == (uint32_t)SAES_NS))
#else
      if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
      {
        HAL_AES_DisableIT(haes, HAL_AES_IT_RNGERR);
      }

      AES_DISABLE(haes);

      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
    {
      /* Write the input block(4 words) in the IN FIFO */
      for (i = 0U; i < 4U ; i++)
      {
        AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)(haes->p_in_buff + (block_count * 4U) + i);
      }

      if (block_count == (data_block_numbers - 1U))
      {
#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_in_cplt_cb(haes);
#else
        HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      }
    }
  }
}

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief AES DMA process for ECB, CBC and CTR algorithms. \n
  *      - Set the DMA configuration
  *      - Start the DMA data transfer from the input user buffer to the AES peripheral, at the end of the transfer, a
  *        callback is then generated
  *      - Start the DMA data transfer from the AES peripheral to the output user buffer, at the end of the transfer a
  *        callback is generated \n
  *        The Padding is not supported.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR Error return when the DMA start transfer fails
  * @retval HAL_OK    DMA process is successfully accomplished
  */
static hal_status_t AES_ECB_CBC_CTR_Process_DMA(hal_aes_handle_t *haes)
{
  haes->hdma_in->p_xfer_cplt_cb = AES_ECB_CBC_CTR_DMAInCplt;
  haes->hdma_in->p_xfer_error_cb = AES_DMAError;
  haes->hdma_out->p_xfer_cplt_cb = AES_ECB_CBC_CTR_DMAOutCplt;

  haes->hdma_out->p_xfer_error_cb = AES_DMAError;

  AES_ENABLE(haes);

  if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_in_buff, (uint32_t)&AES_GET_INSTANCE(haes)->DINR,
                                     haes->data_size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

    haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_error_cb(haes);
#else
    HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

    return HAL_ERROR;
  }

  if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_out, (uint32_t)&AES_GET_INSTANCE(haes)->DOUTR,
                                     (uint32_t)haes->p_out_buff, haes->data_size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

    haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_error_cb(haes);
#else
    HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

    return HAL_ERROR;
  }

  SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);

  return HAL_OK;
}

/**
  * @brief  DMA AES transfer in the complete callback for ECB, CBC and CTR algorithms.
  * @param  hdma DMA handle
  */
static void AES_ECB_CBC_CTR_DMAInCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN);

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_in_cplt_cb(haes);
#else
  HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
}

/**
  * @brief  DMA AES transfer out complete callback for ECB, CBC and CTR algorithms.
  * @param  hdma DMA handle
  */
static void AES_ECB_CBC_CTR_DMAOutCplt(hal_dma_handle_t *hdma)
{
  uint32_t data_size_sum_byte_tmp;

  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAOUTEN);

  HAL_AES_ClearFlagCC(haes);

  AES_DISABLE(haes);

  data_size_sum_byte_tmp = haes->data_size_sum_byte;
  haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

  haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_out_cplt_cb(haes);
#else
  HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
}
#endif /* USE_HAL_AES_DMA */

