STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
 || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/**
  * @brief Process the user data through three phases.
  *      - Initial phase: A mandatory phase which consists of:
  *                      - for GCM: Preparing the hash subkey
  *                      - for CCM: Computing the counter using b0
  *      - Header phase: This phase is skipped for GCM and CCM when the user provides a null header (b1). It consists of
  *                      - for GCM: Processing the additional authenticated data (AAD), with hash computation only,
  *                                 which is the input of GF2mul function to generate the tag
  *                      - for CCM: Processing the associated data (A), with tag computation only
  *      - Payload phase: This phase is skipped for GCM and CCM when the user provided null plaintext. It consists of
  *                       Processing all user data by blocks from the user input buffer to the input data register and
  *                       from the output data register to the output data buffer
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Process(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  if (haes->data_size_sum_byte  == 0U)
  {
    if (AES_SetInitPhase(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    if (haes->header_size_byte == 0U)
    {
      if (haes->data_size_byte == 0U)
      {
        MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
        AES_ENABLE(haes);
        return HAL_OK;
      }
    }
    else
    {
      if (AES_SetHeaderPhase(haes, timeout_ms) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
  {
    if (AES_SetPayloadPhase(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initial AES process mandatory phase which consists of:
  *         - for GCM: preparing the hash subkey
  *         - for CCM: computing the counter using b0
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetInitPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_INIT);
  AES_ENABLE(haes);

  if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}

/**
  * @brief  Header AES process phase.
  *       - This phase is skipped when the user provided a null header (b1)
  *       - It consists of processing all header data by blocks from the user input buffer to the input data register
  *       - The driver pads the missing words of the last block with zeros
  *       - No read from AES output data register is required
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetHeaderPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  uint32_t valid_header_block_numbers = haes->header_size_byte / 16U;
  uint32_t remaining_header_bytes = haes->header_size_byte % 16U;
  uint32_t offset;
  uint32_t header_block_count;

  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_HEADER);
  AES_ENABLE(haes);

  /* Write all the valid blocks (multiple of 4 words), no read to be performed for the header */
  for (header_block_count = 0U; header_block_count < valid_header_block_numbers; header_block_count++)
  {
    haes->block_count = header_block_count;
    offset = haes->block_count * 4U;
    /* Write the input block in the IN FIFO */
    for (uint32_t i = 0U; i < 4U ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)((haes->p_header + offset) + i);
    }

    if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    HAL_AES_ClearFlagCC(haes);
  }

  haes->block_count = header_block_count;

  /* Process the last incomplete block if exist:If some bytes lasts they must be processed in one last block */
  if (remaining_header_bytes != 0U)
  {
    if (AES_PaddingData(haes, haes->p_header, remaining_header_bytes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Payload AES process phase.
  *       - This phase is skipped when the user provided null plaintext
  *       - It consists of processing all user data by blocks from the user input buffer to the input data register and
  *         from the output data register to the output data buffer
  *       - The driver pads the missing words of the last block with zeros
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetPayloadPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  uint32_t valid_payload_block_numbers = haes->data_size_byte / 16U;
  uint32_t remaining_payload_bytes = haes->data_size_byte % 16U;
  uint32_t tmp;
  uint32_t payload_block_count;
  uint32_t data_size_sum_byte_tmp;

  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
  AES_ENABLE(haes);

  /* Process all the valid blocks (multiple of 4 words) */
  for (payload_block_count = 0U; payload_block_count < valid_payload_block_numbers; payload_block_count++)
  {
    haes->block_count = payload_block_count;
    if (AES_ProcessOneblock(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

