STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
  haes->block_count = payload_block_count;

  /* Process the last incomplete block if exist: If some bytes lasts they must be processed in one last block */
  if (remaining_payload_bytes != 0U)
  {
    tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((tmp == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (tmp == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }

    if (AES_PaddingData(haes, haes->p_in_buff, remaining_payload_bytes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

  data_size_sum_byte_tmp = haes->data_size_sum_byte;
  haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

  return HAL_OK;
}

/**
  * @brief  Padding the missing words within the last block with zeros then process a complete padded block.
  * @param  haes            Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff   Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes The number of bytes within the last block
  * @param  timeout_ms      Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT     AES process exceeds user timeout
  * @retval HAL_OK          AES process is successfully accomplished
  */
static hal_status_t AES_PaddingData(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                    uint32_t timeout_ms)
{
  uint32_t last_block_valid_words_numbers;
  uint32_t offset = haes->block_count * 4U;
  const uint32_t *current_address;
  uint32_t counter = 0;
  uint32_t temp[4] = {0};
  uint32_t i;
  uint32_t tmp;
  uint32_t size_tmp = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset);

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes % 4U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DATATYPE) * 2U) + (size_tmp % 4U)];
      AES_GET_INSTANCE(haes)->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U) / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  while (counter < (4U - last_block_valid_words_numbers))
  {
    AES_GET_INSTANCE(haes)->DINR = 0x0U;
    counter++;
  }

  if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  HAL_AES_ClearFlagCC(haes);

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_PAYLOAD)
  {
    for (i = 0U; i < 4U ; i++)
    {
      temp[i] = AES_GET_INSTANCE(haes)->DOUTR;
    }
    i = 0U;
    while ((offset < ((haes->data_size_byte + 3U) / 4U)) && (i < 4U))
    {
      *(uint32_t *)(haes->p_out_buff + offset) = temp[i];
      offset++;
      i++;
    }
  }

  return HAL_OK;
}

/**
  * @brief Enable interrupts and generate computation complete interrupt via one of two cases:
  *        - Case 1: Accomplish the Init phase for the first encrypt call
  *        - Case 2: Skip the Init phase in case of processing the message with several encrypt runs and starts the
  *          payload phase by processing calling the AES_StartPayloadPhase_IT() API
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  Error return when the Init phase fails
  * @retval HAL_OK     AES starting IT process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Start_Process_IT(hal_aes_handle_t *haes)
{
  uint32_t size_tmp = haes->data_size_byte;

  /* Enable interrupts and generate computation complete interrupt by setting the Init phase for first encrypt call */
  if (haes->data_size_sum_byte  == 0U)
  {
    if ((haes->header_size_byte == 0U) && ((size_tmp == 0U)))
    {
      if (AES_SetInitPhase_NonBlocking(haes) != HAL_OK)
      {
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_error_cb(haes);
#else
        HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
        return HAL_ERROR;
      }
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
      AES_ENABLE(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
    else
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_INIT);
      AES_ENABLE(haes);

      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }
  /* Skip the Init phase in case of processing the message with several encrypt runs, Enable interrupts and generate the
    computation complete interrupt via AES_StartPayloadPhase_IT: process one block */
  else
  {
    if ((size_tmp != 0U) && (haes->p_in_buff != NULL))
    {
      AES_StartPayloadPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initial AES process in non blocking mode which consists of:
  *         - for GCM: preparing the hash subkey
  *         - for CCM: computing the counter using b0
  * @param  haes       Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  AES Init phase exceeds AES_INIT_PHASE_LATENCY
  * @retval HAL_OK     AES Init phase is successfully accomplished
  */
static hal_status_t AES_SetInitPhase_NonBlocking(hal_aes_handle_t *haes)
{
  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_INIT);
  AES_ENABLE(haes);

  if (AES_WaitOnCCFlag_NonBlocking(haes, AES_INIT_PHASE_LATENCY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}

/**
  * @brief Performing the header phase in interrupt mode for GCM, GMAC and CCM algorithms. \n
  *        Once the Init phase is set by AES_GCM_GMAC_CCM_Start_Process_IT() API, a computation complete interrupt is
  *        generated, then the program enters the IRQHandler, and starts performing the header phase: Each block
  *        writing generates the computation complete interrupt (No block reading during the header phase).
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_SetHeaderPhase_IT(hal_aes_handle_t *haes)
{
  uint32_t header_block_numbers = (haes->header_size_byte + 15U) / 16U;
  uint32_t valid_header_block_numbers = haes->header_size_byte / 16U;
  uint32_t remaining_header_bytes = haes->header_size_byte % 16U;
  uint32_t offset;
  uint32_t header_block_count = haes->block_count;

  /* Process all the valid blocks (multiple of 4 words):Write blocks only */
  if (header_block_count < valid_header_block_numbers)
  {
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
    /* A suspension is already requested */
    if ((haes->suspend_request == AES_SUSPEND) && (header_block_count > 0U))
    {
      haes->suspend_request = AES_SUSPEND_NONE;
      HAL_AES_ClearFlagCC(haes);
      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
    {
      offset = header_block_count * 4U;
      /* Write the input block in the IN FIFO */
      for (uint32_t i = 0U; i < 4U ; i++)
      {
        AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)((haes->p_header + offset) + i);
      }

      header_block_count++;
      haes->block_count = header_block_count;
    }
  }
  /* Process the last padded block ( if exist) */
  else
  {
    /* No last block, all header was processed */
    if (header_block_count == header_block_numbers)
    {
      /* When all the header is processed there are two possible cases:
      Case1: Proceed to payload phase: AES_StartPayloadPhase_IT
      Case2: Plaintext null: Disable interrupts and end process */
      if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
      {
        haes->block_count = 0U;
        HAL_AES_ClearFlagCC(haes);
        MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
        AES_StartPayloadPhase_IT(haes);
      }
      else
      {
        /* Disable Computation Complete flag and errors interrupts */
        HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_in_cplt_cb(haes);
#else
        HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      }
    }
    else
    {
      AES_PaddingData_IT(haes, haes->p_header, remaining_header_bytes);
      header_block_count++;
      haes->block_count = header_block_count;
    }
  }
}

/**
  * @brief  Start the payload phase by writing the first block to generate a computation complete interrupt.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_StartPayloadPhase_IT(hal_aes_handle_t *haes)
{
  uint32_t valid_payload_block_numbers = haes->data_size_byte / 16U;
  uint32_t remaining_payload_bytes = haes->data_size_byte % 16U;
  uint32_t tmp;

  /* Process the first valid block if exist to generate the computation complete interrupt */
  if ((valid_payload_block_numbers - haes->block_count) != 0U)
  {
    /* Write the input block(4 words) in the IN FIFO */
    for (uint32_t i = 0U; i < 4U ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)(haes->p_in_buff + (haes->block_count * 4U) + i);
    }
  }
  /* No valid block exist: Pad the only one last block and Process it to generate the computation complete interrupt */
  else
  {
    tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((tmp == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (tmp == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }

