STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
    AES_PaddingData_IT(haes, haes->p_in_buff, remaining_payload_bytes);

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_in_cplt_cb(haes);
#else
    HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
  }
}

/**
  * @brief Performing the payload phase in interrupt mode for GCM, GMAC and CCM algorithms. \n
  *        Once a computation complete interrupt is generated by the AES_StartPayloadPhase_IT() API, the program enters
  *        the IRQHandler, reads the encrypted block from the output data register and performs the write of a new block
  *        , then a second interrupt is generated.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_SetPayloadPhase_IT(hal_aes_handle_t *haes)
{
  uint32_t data_block_numbers = (haes->data_size_byte + 15U) / 16U;
  uint32_t valid_block_numbers = haes->data_size_byte / 16U;
  uint32_t remaining_payload_bytes = haes->data_size_byte % 16U;
  uint32_t offset;
  uint32_t block_count = haes->block_count;
  uint32_t tmp;
  uint32_t temp[4] = {0};
  uint32_t i;
  uint32_t data_size_sum_byte_tmp;

  /* Read from DOUTR after each computation complete interrupt
     First start to read the first block processed via AES_StartPayloadPhase_IT */
  if (block_count < data_block_numbers)
  {
    offset = block_count * 4U;
    for (i = 0U; i < 4U ; i++)
    {
      temp[i] = AES_GET_INSTANCE(haes)->DOUTR;
    }
    i = 0U;
    while ((offset < ((haes->data_size_byte + 3U) / 4U)) && (i < 4U))
    {
      *(uint32_t *)(haes->p_out_buff + offset) = temp[i];
      offset++;
      i++;
    }
  }

  block_count++;
  haes->block_count = block_count;
  offset = block_count * 4U;

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  /* A suspension is already requested */
  if (haes->suspend_request == AES_SUSPEND)
  {
    if (block_count <= valid_block_numbers)
    {
      HAL_AES_ClearFlagCC(haes);

      haes->suspend_request = AES_SUSPEND_NONE;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }
  else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
  {
    /* Process valid blocks: write to DINR generates a computation complete interrupt */
    if (block_count < valid_block_numbers)
    {
      /* Write the input block in the IN FIFO */
      for (i = 0U; i < 4U ; i++)
      {
        AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)((haes->p_in_buff + offset) + i);
      }
    }
    /* If all valid blocks are processed: Two possible cases
     Case 1: Pad data and process the last padded block if exist
     Case 2: Invalid block does not exist and all the data is processed :Disable interrupts and end process */
    else if (block_count == valid_block_numbers)
    {
      /* Case1 : Pad data and process the last padded block if exist */
      if (remaining_payload_bytes != 0U)
      {
        tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
        if ((tmp == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
            || (tmp == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
        {
          MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
        }

        AES_PaddingData_IT(haes, haes->p_in_buff, remaining_payload_bytes);
      }
      /* Case 2: Invalid block does not exist and all the data is processed :Disable interrupts and end process */
      else
      {
        data_size_sum_byte_tmp = haes->data_size_sum_byte;
        haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

        /* Disable Computation Complete flag and errors interrupts */
        HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

        haes->global_state = HAL_AES_STATE_IDLE;
      }

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_in_cplt_cb(haes);
#else
      HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    /* If all data is processed: The last padded block was just processed in the previous interrupt */
    else
    {
      data_size_sum_byte_tmp = haes->data_size_sum_byte;
      haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_out_cplt_cb(haes);
#else
      HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }
}

/**
  * @brief  Padding the missing words within the last block with zeros then process a complete padded block in IT mode.
  * @param  haes            Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff   Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes The number of bytes within the last block
  */
static void AES_PaddingData_IT(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes)
{
  uint32_t last_block_valid_words_numbers;
  uint32_t offset = haes->block_count * 4U;
  const uint32_t *current_address;
  uint32_t counter = 0;
  uint32_t i;
  uint32_t tmp;
  uint32_t size_tmp = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset);

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes % 4U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DATATYPE) * 2U) + (size_tmp % 4U)];
      AES_GET_INSTANCE(haes)->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U) / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  while (counter < (4U - last_block_valid_words_numbers))
  {
    AES_GET_INSTANCE(haes)->DINR = 0x0U;
    counter++;
  }
}

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief  AES DMA process for GCM, GMAC and CCM algorithm through three phases:
  *       - Initial phase: A mandatory phase Handled only by AES (No DMA transfer) and consists of:
  *                        - for GCM: preparing hash subkey
  *                        - for CCM: computing the counter using b0
  *       - Header phase: This phase is skipped for GCM and CCM when the user provides a null header (b1).
  *                       It consists of:
  *                       - processing all valid header blocks(four words) from the provided user header to the AES
  *                        peripheral (The padding is handled without DMA)
  *       - Payload phase: This phase is skipped for GCM and CCM when the user provides a null plaintext.It consists of:
  *                       - processing all valid plaintext blocks (The padding is handled without DMA)
  * @param  haes       Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  Error return when the DMA start transfer fails or when the AES process exceeds INIT PHASE latency
  * @retval HAL_OK     DMA process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Process_DMA(hal_aes_handle_t *haes)
{
  hal_status_t status = HAL_ERROR;
  uint32_t size_tmp = haes->data_size_byte;

  if (haes->data_size_sum_byte  == 0U)
  {
    if (AES_SetInitPhase_NonBlocking(haes) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

