STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
    if ((haes->header_size_byte == 0U) && ((size_tmp == 0U)))
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
      AES_ENABLE(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_OK;
    }
    else if (haes->header_size_byte != 0U)
    {
      status = AES_SetHeaderPhase_DMA(haes);
    }
    else
    {
      status = AES_SetPayloadPhase_DMA(haes);
    }
  }
  else if ((size_tmp != 0U) && (haes->p_in_buff != NULL))
  {
    status = AES_SetPayloadPhase_DMA(haes);
  }
  else
  {
    /* Nothing to do */
  }

  return status;
}

/**
  * @brief AES DMA Payload phase process.
  *      - This phase is skipped when the user provided null plaintext
  *      - There are two possible cases to process data:
  *       - Case1:When there is valid data blocks, the AES_SetPayloadPhase_DMA() acts as follows:
  *         - set the DMA configuration
  *         - start the DMA transfer of all valid data blocks from the input user buffer to the AES peripheral, at the
  *          end of the transfer a callback is generated
  *         - start the DMA data transfer from the AES peripheral to the output user buffer, at the end of the transfer
  *          a callback is generated and handle the invalid last block if exists(Pad missing words with zeros  and
  *          transfer the last block without DMA from the input buffer to the AES peripheral and read out its equivalent
  *          encrypted block
  *       - Case2:When there is any valid data block, (only unique incomplete block) the AES_SetPayloadPhase_DMA() acts
  *         as follows:
  *         - Pad missing words with zeros and transfer data without DMA from the input buffer to the AES peripheral
  *           and read out its equivalent encrypted block
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @note   The minimum data amount transferred with DMA is equal to one block (four complete words), as the DMA
            transfer does not support the padding(the driver handles the padding with a direct transfer of incomplete
            data without using the DMA)
  * @retval HAL_ERROR   Error return when the DMA start transfer fails or when the payload phase exceeds payload latency
  * @retval HAL_OK      DMA process is successfully accomplished
  */
static hal_status_t AES_SetPayloadPhase_DMA(hal_aes_handle_t *haes)
{
  uint32_t tmp;
  uint32_t data_size_sum_byte_tmp;
  uint32_t valid_payload_block_numbers = haes->data_size_byte / 16U;
  uint32_t remaining_payload_bytes = haes->data_size_byte % 16U;


  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_PAYLOAD);
  AES_ENABLE(haes);

  /* If the payload size is at least equal to 16 bytes, feed the payload through DMA.
     If the size_in_bytes is not a multiple of blocks (is not a multiple of four 32- bit words ),
     last bytes feeding and padding is done in AES_DMAInCplt() */
  if (valid_payload_block_numbers > 0U)
  {
    /* Set the AES DMA In transfer complete callback */
    haes->hdma_in->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAInCplt;
    /* Set the DMA In error callback */
    haes->hdma_in->p_xfer_error_cb = AES_DMAError;

    /* Set the AES DMA Out transfer complete callback */
    haes->hdma_out->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAOutCplt;
    /* Set the DMA Out error callback */
    haes->hdma_out->p_xfer_error_cb = AES_DMAError;

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_in_buff,
                                       (uint32_t)&AES_GET_INSTANCE(haes)->DINR,
                                       valid_payload_block_numbers * 16U, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_out, (uint32_t)&AES_GET_INSTANCE(haes)->DOUTR,
                                       (uint32_t)haes->p_out_buff, valid_payload_block_numbers * 16U,
                                       HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }

    /* Enable the DMA transfer by setting the DMAEN bit */
    SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);
  }
  else
  {
    tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((tmp == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (tmp == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }
    if (AES_PaddingData_DMA(haes, haes->p_in_buff, remaining_payload_bytes, AES_PAYLOAD_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

    data_size_sum_byte_tmp = haes->data_size_sum_byte;
    haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;
    haes->global_state = HAL_AES_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  AES DMA Header phase process.
  *       - This phase is skipped when the user provided a null header
  *       - Two possible cases to process data:
  *        - Case1: When there is valid data blocks, the AES_SetHeaderPhase_DMA() acts as follows:
  *          - set the DMA configuration
  *          - start the DMA transfer of all valid data blocks from the input user header to the AES peripheral, at the
  *           end of the transfer a callback is generated and accomplish the following operations:
  *          - Handles the invalid last block if exist(Pad missing words with zeros  and transfer last block without
  *            DMA from input header to AES peripheral
  *          - Initiate the payload phase if plaintext is not null
  *        - Case2: When there is any valid data block, (only unique incomplete block) the AES_SetHeaderPhase_DMA() acts
  *          as follows:
  *          - Pad missing words with zeros  and transfer data without DMA from input header to AES peripheral
  *          - Initiate the payload phase if plaintext is not null
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @note   The minimum data amount transferred with DMA is equal to one block (four complete words), as the DMA
  *         transfer does not support the padding(the driver handles the padding with a direct transfer of incomplete
  *         data without using the DMA)
  * @retval HAL_ERROR   Error return when the DMA start transfer fails or when the header phase exceeds header latency
  * @retval HAL_OK      DMA process is successfully  accomplished
  */
static hal_status_t AES_SetHeaderPhase_DMA(hal_aes_handle_t *haes)
{
  uint32_t valid_header_block_numbers = haes->header_size_byte / 16U;
  uint32_t remaining_header_bytes = haes->header_size_byte % 16U;

  haes->hdma_in->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAInCplt;
  haes->hdma_in->p_xfer_error_cb = AES_DMAError;

  MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH, AES_PHASE_HEADER);
  AES_ENABLE(haes);

  /* If the header size is at least equal to 16 bytes, feed the header via DMA. else if it is not a multiple of block
     , the last bytes feeding and padding is done in AES_DMAInCplt() */
  if (valid_header_block_numbers > 0U)
  {

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_header, (uint32_t)&AES_GET_INSTANCE(haes)->DINR,
                                       valid_header_block_numbers * 16U, HAL_DMA_OPT_IT_NONE) == HAL_OK)
    {
      SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN);
    }
    else
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }
  }
  else
  {
    if (AES_PaddingData_DMA(haes, haes->p_header, remaining_header_bytes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

