STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.c
    if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
    {
      haes->block_count = 0U;
      if (AES_SetPayloadPhase_DMA(haes) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
    else
    {
      HAL_AES_ClearFlagCC(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Padding the missing words within the last block with zeros during a DMA transfer.
  * @param  haes                Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff       Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes     The number of bytes within the last block
  * @param  latency_clock_cycle Specify Latency value in clock cycles
  * @retval HAL_ERROR           Error return when the DMA padding exceeds latency
  * @retval HAL_OK              DMA padding is successfully  accomplished
  */
static hal_status_t AES_PaddingData_DMA(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                        uint32_t latency_clock_cycle)
{
  uint32_t last_block_valid_words_numbers;
  uint32_t offset = haes->block_count * 4U;
  const uint32_t *current_address;
  uint32_t counter = 0;
  uint32_t temp[4] = {0};
  uint32_t i;
  uint32_t tmp;
  uint32_t size_tmp = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset);

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes % 4U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DATATYPE) * 2U) + (size_tmp % 4U)];
      AES_GET_INSTANCE(haes)->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U) / 4U;
    /* Process valid words within the last block */
    for (i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      AES_GET_INSTANCE(haes)->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  while (counter < (4U - last_block_valid_words_numbers))
  {
    AES_GET_INSTANCE(haes)->DINR = 0x0U;
    counter++;
  }

  /* Wait for Computation Complete Flag (CCF) to raise then clear it */
  if (AES_WaitOnCCFlag_NonBlocking(haes, latency_clock_cycle) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_PAYLOAD)
  {
    for (i = 0U; i < 4U ; i++)
    {
      temp[i] = AES_GET_INSTANCE(haes)->DOUTR;
    }
    i = 0U;
    while ((offset < ((haes->data_size_byte + 3U) / 4U)) && (i < 4U))
    {
      *(uint32_t *)(haes->p_out_buff + offset) = temp[i];
      offset++;
      i++;
    }
  }

  return HAL_OK;
}

/**
  * @brief  DMA AES transfer in complete callback for GCM, GMAC and CCM algorithms.
  * @param  hdma DMA handle
  */
static void AES_GCM_GMAC_CCM_DMAInCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  uint32_t valid_header_block_numbers = haes->header_size_byte / 16U;
  uint32_t remaining_header_bytes = haes->header_size_byte % 16U;

  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN);

  /* A DMA transfer complete callback generated from HEADER phase */
  if (READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_GCMPH) == AES_PHASE_HEADER)
  {
    /* Wait for Computation Complete Flag (CCF) to raise then clear it */
    if (AES_WaitOnCCFlag_NonBlocking(haes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
    {

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return;
    }

    HAL_AES_ClearFlagCC(haes);

    /* Pad last block if exist */
    if (remaining_header_bytes != 0U)
    {
      haes->block_count = valid_header_block_numbers;
      if (AES_PaddingData_DMA(haes, haes->p_header, remaining_header_bytes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
      {
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_error_cb(haes);
#else
        HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
        return;
      }
    }

    if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
    {
      haes->block_count = 0U;
      (void) AES_SetPayloadPhase_DMA(haes);
    }
    else
    {
      HAL_AES_ClearFlagCC(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
  }
  else /* Payload input complete */
  {
#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_in_cplt_cb(haes);
#else
    HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
  }
}

/**
  * @brief  DMA AES transfer out complete callback for GCM, GMAC and CCM algorithms.
  * @param  hdma DMA handle
  */
static void AES_GCM_GMAC_CCM_DMAOutCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  uint32_t valid_payload_block_numbers = haes->data_size_byte / 16U;
  uint32_t remaining_payload_bytes = haes->data_size_byte % 16U;
  uint32_t tmp;
  uint32_t data_size_sum_byte_tmp;

  CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAOUTEN);

  /* Check if last block exists after DMA transfer complete callback generated from PAYLOAD phase */
  if (remaining_payload_bytes != 0U)
  {
    HAL_AES_ClearFlagCC(haes);
    tmp = READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((tmp == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (tmp == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }

    haes->block_count = valid_payload_block_numbers;

    if (AES_PaddingData_DMA(haes, haes->p_in_buff, remaining_payload_bytes, AES_PAYLOAD_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return;
    }
  }

  HAL_AES_ClearFlagCC(haes);

  data_size_sum_byte_tmp = haes->data_size_sum_byte;
  haes->data_size_sum_byte = data_size_sum_byte_tmp + haes->data_size_byte;

  haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_out_cplt_cb(haes);
#else
  HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

}
#endif /* USE_HAL_AES_DMA */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
/**
  * @}
  */
#endif /* USE_HAL_AES_ECB_CBC_ALGO || USE_HAL_AES_CTR_ALGO || USE_HAL_AES_GCM_GMAC_ALGO || USE_HAL_AES_CCM_ALGO*/
#endif /* USE_HAL_AES_MODULE */

/**
  * @}
  */
#endif /* AES or SAES */
/**
  * @}
  */
